# chap7. 데이터 정제 및 준비

## 7.1 누락된 데이터 처리하기

In [1]:
import pandas as pd
import numpy as np

In [2]:
string_data=pd.Series(['aardvark','artichoke',np.nan,'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [3]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [4]:
string_data[0]=None

In [5]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

### 7.1.1 누락된 데이터 골라내기

In [6]:
from numpy import nan as NA

In [7]:
data=pd.Series([1,NA,3.5,NA,7])

In [8]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [9]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [10]:
data=pd.DataFrame([[1.,6.5,3.],[1.,NA,NA],[NA,NA,NA],[NA,6.5,3.]])

In [11]:
cleaned=data.dropna()

In [12]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [13]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [14]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [15]:
data[4]=NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [16]:
data.dropna(axis=1,how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [17]:
df=pd.DataFrame(np.random.randn(7,3))

In [18]:
df.iloc[:4,1]=NA

In [19]:
df.iloc[:2,2]=NA

In [20]:
df

          0         1         2
0 -1.714960       NaN       NaN
1 -0.421407       NaN       NaN
2  0.726602       NaN  0.327237
3  0.834077       NaN  0.634892
4 -0.512755  0.962881 -0.301979
5  0.720674 -0.067163 -0.867492
6  2.303290  1.653797 -0.784883

In [21]:
df.dropna()

          0         1         2
4 -0.512755  0.962881 -0.301979
5  0.720674 -0.067163 -0.867492
6  2.303290  1.653797 -0.784883

In [22]:
df.dropna(thresh=2)

          0         1         2
2  0.726602       NaN  0.327237
3  0.834077       NaN  0.634892
4 -0.512755  0.962881 -0.301979
5  0.720674 -0.067163 -0.867492
6  2.303290  1.653797 -0.784883

### 7.1.2 결측치 채우기

In [23]:
df.fillna(0)

          0         1         2
0 -1.714960  0.000000  0.000000
1 -0.421407  0.000000  0.000000
2  0.726602  0.000000  0.327237
3  0.834077  0.000000  0.634892
4 -0.512755  0.962881 -0.301979
5  0.720674 -0.067163 -0.867492
6  2.303290  1.653797 -0.784883

In [24]:
df.fillna({1:0.5,2:0})

          0         1         2
0 -1.714960  0.500000  0.000000
1 -0.421407  0.500000  0.000000
2  0.726602  0.500000  0.327237
3  0.834077  0.500000  0.634892
4 -0.512755  0.962881 -0.301979
5  0.720674 -0.067163 -0.867492
6  2.303290  1.653797 -0.784883

In [25]:
_=df.fillna(0,inplace=True)
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [26]:
df=pd.DataFrame(np.random.randn(6,3))

In [27]:
df.iloc[2:,1]=NA

In [28]:
df.iloc[4:,2]=NA

In [29]:
df

          0         1         2
0  0.343127 -0.667707 -0.170083
1 -0.157655 -1.450003 -0.831966
2 -0.573638       NaN  0.531347
3  1.497005       NaN -0.078328
4 -0.110812       NaN       NaN
5 -0.319087       NaN       NaN

In [30]:
df.fillna(method='ffill')

          0         1         2
0  0.343127 -0.667707 -0.170083
1 -0.157655 -1.450003 -0.831966
2 -0.573638 -1.450003  0.531347
3  1.497005 -1.450003 -0.078328
4 -0.110812 -1.450003 -0.078328
5 -0.319087 -1.450003 -0.078328

In [31]:
df.fillna(method='ffill',limit=2)

          0         1         2
0  0.343127 -0.667707 -0.170083
1 -0.157655 -1.450003 -0.831966
2 -0.573638 -1.450003  0.531347
3  1.497005 -1.450003 -0.078328
4 -0.110812       NaN -0.078328
5 -0.319087       NaN -0.078328

In [32]:
data=pd.Series([1.,NA,3.5,NA,7])

In [33]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

## 7.2 데이터 변형
### 7.2.1 중복 제거하기

In [34]:
data=pd.DataFrame({'k1':['one','two']*3+['two'],'k2':[1,1,2,3,3,4,4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [35]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [36]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [37]:
data['v1']=range(7)

In [38]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [39]:
data.drop_duplicates(['k1','k2'],keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

### 7.2.2 함수나 매핑을 이용해서 데이터 변형하기

In [40]:
data=pd.DataFrame({'food':['bacon','pulled pork','bacon','Pastrami','corned beef'
                           ,'Bacon','pastrami','honey ham','nova lox'],
                   'ounces':[4,3,12,6,7.5,8,3,5,6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [41]:
meat_to_animal={
    'bacon':'pig',
    'pulled pork':'pig',
    'pastrami':'cow',
    'corned beef':'cow',
    'honey ham':'pig',
    'nova lox':'salmon'
}

In [42]:
lowercased=data['food'].str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [43]:
data['animal']=lowercased.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [44]:
data['food'].map(lambda x:meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

### 7.2.3 값 치환하기

In [45]:
data=pd.Series([1.,-999.,2.,-999.,-1000.,3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [46]:
data.replace(-999,np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [47]:
data.replace([-999,-1000],np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [48]:
data.replace([-999,-1000],[np.nan,0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [49]:
data.replace({-999:np.nan,-1000:0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

### 7.2.4 축 색인 이름 바꾸기

In [50]:
data=pd.DataFrame(np.arange(12).reshape((3,4)),
                 index=['Ohio','Colorada','New York'],
                 columns=['one','two','three','four'])

In [51]:
transform=lambda x: x[:4].upper()

In [52]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [53]:
data.index=data.index.map(transform)
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [54]:
data.rename(index=str.title,columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [55]:
data.rename(index={'OHIO':'INDIANA'},columns={'three':'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [56]:
data.rename(index={'OHIO':'INDIANA'},inplace=True)
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

### 7.2.5 개별화와 양자화

In [57]:
ages=[20,22,25,27,21,23,37,31,61,45,41,32]

In [58]:
bins=[18,25,35,60,100]

In [59]:
cats=pd.cut(ages,bins)

In [60]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [61]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [62]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [63]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [64]:
pd.cut(ages,[18,26,36,61,100],right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [65]:
group_names=['Youth','YoungAdult','MiddleAged','Senior']

In [66]:
pd.cut(ages,bins, labels=group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [67]:
data=np.random.rand(20)

In [68]:
pd.cut(data,4,precision=2)

[(0.033, 0.26], (0.033, 0.26], (0.26, 0.48], (0.033, 0.26], (0.48, 0.71], ..., (0.71, 0.93], (0.71, 0.93], (0.033, 0.26], (0.26, 0.48], (0.48, 0.71]]
Length: 20
Categories (4, interval[float64]): [(0.033, 0.26] < (0.26, 0.48] < (0.48, 0.71] < (0.71, 0.93]]

In [69]:
data=np.random.randn(1000)

In [70]:
cats=pd.qcut(data,4)

In [71]:
cats

[(0.0565, 0.673], (0.0565, 0.673], (-0.707, 0.0565], (-0.707, 0.0565], (-4.117, -0.707], ..., (-4.117, -0.707], (0.0565, 0.673], (-0.707, 0.0565], (-4.117, -0.707], (0.0565, 0.673]]
Length: 1000
Categories (4, interval[float64]): [(-4.117, -0.707] < (-0.707, 0.0565] < (0.0565, 0.673] < (0.673, 3.046]]

In [72]:
pd.value_counts(cats)

(0.673, 3.046]      250
(0.0565, 0.673]     250
(-0.707, 0.0565]    250
(-4.117, -0.707]    250
dtype: int64

### 7.2.6 특잇값을 찾고 제외하기

In [73]:
data=pd.DataFrame(np.random.randn(1000,4))

In [74]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.007027    -0.029568    -0.003005     0.033683
std       0.959676     0.972902     0.994910     0.995541
min      -3.052524    -3.246641    -3.057780    -3.002285
25%      -0.645071    -0.674387    -0.699793    -0.668500
50%      -0.002926    -0.017031     0.010480     0.056114
75%       0.624405     0.611522     0.659920     0.736804
max       3.419133     2.900943     3.422708     2.818586

In [75]:
col=data[2]

In [76]:
col[np.abs(col)>3]

378    3.422708
939   -3.057780
Name: 2, dtype: float64

In [77]:
data[(np.abs(data)>3).any(1)]

            0         1         2         3
279 -0.340885 -3.226214  0.947671  0.355862
378 -0.260813  0.363950  3.422708  0.949808
583 -0.627225 -3.246641  0.717199  2.384885
593  3.054581 -0.498103  0.085863  0.328424
604  3.419133 -1.748884 -0.480721 -0.242563
740 -0.828674  1.227954 -0.534352 -3.002285
801 -3.013556 -1.391376  1.177623 -0.139670
856 -3.052524 -2.290395 -2.007842 -0.208314
939 -1.788602  0.476093 -3.057780  0.738446

In [78]:
data[np.abs(data)>3]=np.sign(data)*3

In [79]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.007435    -0.029095    -0.003370     0.033685
std       0.957887     0.971398     0.993366     0.995534
min      -3.000000    -3.000000    -3.000000    -3.000000
25%      -0.645071    -0.674387    -0.699793    -0.668500
50%      -0.002926    -0.017031     0.010480     0.056114
75%       0.624405     0.611522     0.659920     0.736804
max       3.000000     2.900943     3.000000     2.818586

In [80]:
np.sign(data).head()

     0    1    2    3
0 -1.0  1.0  1.0 -1.0
1  1.0  1.0  1.0  1.0
2 -1.0 -1.0  1.0  1.0
3  1.0 -1.0 -1.0 -1.0
4 -1.0  1.0  1.0  1.0

### 7.2.7 치환과 임의 샘플링

In [81]:
df=pd.DataFrame(np.arange(5*4).reshape((5,4)))

In [82]:
sampler=np.random.permutation(5)

In [83]:
sampler

array([0, 4, 3, 1, 2])

In [84]:
df

    0   1   2   3
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [85]:
df.take(sampler)

    0   1   2   3
0   0   1   2   3
4  16  17  18  19
3  12  13  14  15
1   4   5   6   7
2   8   9  10  11

In [86]:
df.sample(n=3)

    0   1   2   3
2   8   9  10  11
1   4   5   6   7
4  16  17  18  19

In [87]:
choices=pd.Series([5,7,-1,6,4])

In [88]:
draws=choices.sample(n=10,replace=True)

In [89]:
draws

1    7
1    7
2   -1
4    4
0    5
2   -1
1    7
1    7
2   -1
2   -1
dtype: int64

### 7.2.8 표시자/더미 변수 계산하기

In [90]:
df=pd.DataFrame({'key':['b','b','a','c','a','b'],'data1':range(6)})

In [91]:
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [92]:
dummies=pd.get_dummies(df['key'],prefix='key')

In [93]:
df_with_dummy=df[['data1']].join(dummies)

In [94]:
df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [95]:
mnames=['movie_id','title','generes']

In [96]:
movies=pd.read_table('movies.dat',sep='::',header=None,names=mnames)

C:\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support regex separators (separators > 1 char and different from '\s+' are interpreted as regex); you can avoid this warning by specifying engine='python'.
  """Entry point for launching an IPython kernel.

In [97]:
movies[:10]

   movie_id                               title                       generes
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy
5         6                         Heat (1995)         Action|Crime|Thriller
6         7                      Sabrina (1995)                Comedy|Romance
7         8                 Tom and Huck (1995)          Adventure|Children's
8         9                 Sudden Death (1995)                        Action
9        10                    GoldenEye (1995)     Action|Adventure|Thriller

In [98]:
all_generes=[]

In [99]:
for x in movies.generes:
    all_generes.extend(x.split('|'))

In [100]:
generes=pd.unique(all_generes)

In [101]:
generes

array(['Animation', "Children's", 'Comedy', 'Adventure', 'Fantasy',
       'Romance', 'Drama', 'Action', 'Crime', 'Thriller', 'Horror',
       'Sci-Fi', 'Documentary', 'War', 'Musical', 'Mystery', 'Film-Noir',
       'Western'], dtype=object)

In [102]:
zero_matrix=np.zeros((len(movies),len(generes)))

In [103]:
dummies=pd.DataFrame(zero_matrix, columns=generes)

In [104]:
gen=movies.generes[0]

In [105]:
gen.split('|')

['Animation', "Children's", 'Comedy']

In [106]:
dummies.columns.get_indexer(gen.split('|'))

array([0, 1, 2], dtype=int64)

In [107]:
for i, gen in enumerate(movies.generes):
    indices=dummies.columns.get_indexer(gen.split('|'))
    dummies.iloc[i,indices]=1

In [108]:
movies_windic=movies.join(dummies.add_prefix('Genre_'))

In [109]:
movies_windic.iloc[0]

movie_id                                       1
title                           Toy Story (1995)
generes              Animation|Children's|Comedy
Genre_Animation                                1
Genre_Children's                               1
Genre_Comedy                                   1
Genre_Adventure                                0
Genre_Fantasy                                  0
Genre_Romance                                  0
Genre_Drama                                    0
Genre_Action                                   0
Genre_Crime                                    0
Genre_Thriller                                 0
Genre_Horror                                   0
Genre_Sci-Fi                                   0
Genre_Documentary                              0
Genre_War                                      0
Genre_Musical                                  0
Genre_Mystery                                  0
Genre_Film-Noir                                0
Genre_Western                                  0
Name: 0, dtype: object

In [110]:
np.random.seed(12345)

In [111]:
values=np.random.rand(10)

In [112]:
values

array([0.92961609, 0.31637555, 0.18391881, 0.20456028, 0.56772503,
       0.5955447 , 0.96451452, 0.6531771 , 0.74890664, 0.65356987])

In [113]:
bins=[0,0.2,0.4,0.6,0.8,1]

In [114]:
pd.get_dummies(pd.cut(values,bins))

   (0.0, 0.2]  (0.2, 0.4]  (0.4, 0.6]  (0.6, 0.8]  (0.8, 1.0]
0           0           0           0           0           1
1           0           1           0           0           0
2           1           0           0           0           0
3           0           1           0           0           0
4           0           0           1           0           0
5           0           0           1           0           0
6           0           0           0           0           1
7           0           0           0           1           0
8           0           0           0           1           0
9           0           0           0           1           0

## 7.3 문자열 다루기
### 7.3.1 문자열 객체 메서드

In [115]:
val='a,b, guido'

In [116]:
val.split(',')

['a', 'b', ' guido']

In [117]:
pieces=[x.strip()for x in val.split(',')] #strip()공백제거

In [118]:
pieces

['a', 'b', 'guido']

In [119]:
first,second,third=pieces

In [120]:
first+'::'+second+'::'+third

'a::b::guido'

In [121]:
'::'.join(pieces)

'a::b::guido'

In [122]:
'guido'in val

True

In [123]:
val.index(',')

1

In [124]:
val.find(':') #문자열을 찾지 못하면 -1

-1

In [126]:
val.count(',')

2

In [127]:
val.replace(',','::')

'a::b:: guido'

In [128]:
val.replace(',','')

'ab guido'

### 7.3.2 정규 표현식

In [129]:
import re #정규 표현식은 텍스트에서 문자열 패턴을 찾는 방법 제공

In [130]:
text="foo bar\t baz \tqux"

In [131]:
re.split('\s+',text) #\s+ 하나 이상의 공백 문자 의미

['foo', 'bar', 'baz', 'qux']

In [132]:
regex=re.compile('\s+')

In [133]:
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [134]:
regex.findall(text) #findall() 정규 표현식에 매칭되는 모든 패턴 목록

[' ', '\t ', ' \t']

In [135]:
text="""Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""
pattern=r'[A-Z0.9._%+-]+@[A-Z0.9.-]+\.[A-Z]{2,4}'

In [136]:
regex=re.compile(pattern, flags=re.IGNORECASE) #re.IGNORECASE 대소문자 구분 x

In [137]:
regex.findall(text) #findall() 패턴과 일치하는 모든 문자열

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [138]:
m=regex.search(text) # search() 패턴과 일치하는 첫 번째 존재

In [139]:
m

In [140]:
text[m.start():m.end()]

'dave@google.com'

In [141]:
print(regex.match(text)) #match() 정규 표현 패턴이 시작점에서부터 일치하는지 검사

None

In [142]:
print(regex.sub('REDACATED',text)) #sub() 찾은 패턴을 문자열로 치환

Dave REDACATED
Steve REDACATED
Rob REDACATED
Ryan REDACATED

In [143]:
pattern=r'([A-Z0.9._%+-]+)@([A-Z0.9.-]+)\.([A-Z]{2,4})'

In [144]:
regex=re.compile(pattern,flags=re.IGNORECASE)

In [145]:
m=regex.match('wesm@bright.net')

In [146]:
m.groups()

('wesm', 'bright', 'net')

In [147]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [148]:
print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3',text))

Dave Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: yahoo, Suffix: com

### 7.3.3 pandas의 벡터화된 문자열 함수

In [159]:
data={'Dave':'dave@google.com','Steve':'steve@gmail.com',
     'Rob':'rob@gmail.com','Wes':np.nan}

In [160]:
data=pd.Series(data)
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [161]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [162]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [163]:
pattern

'([A-Z0.9._%+-]+)@([A-Z0.9.-]+)\\.([A-Z]{2,4})'

In [164]:
data.str.findall(pattern,flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [165]:
matches=data.str.match(pattern,flags=re.IGNORECASE)
matches

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object

In [166]:
data.str[:5]

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object